zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/eic.h
#define EIC_LEVEL_NMI_Pos           0            /**< \brief (EIC_LEVEL) External Non Maskable CPU interrupt */
#define EIC_LEVEL_NMI               (_U(0x1) << EIC_LEVEL_NMI_Pos)
#define EIC_LEVEL_INT1_Pos          1            /**< \brief (EIC_LEVEL) External Interrupt 1 */
#define EIC_LEVEL_INT1              (_U(0x1) << EIC_LEVEL_INT1_Pos)
#define EIC_LEVEL_INT2_Pos          2            /**< \brief (EIC_LEVEL) External Interrupt 2 */
#define EIC_LEVEL_INT2              (_U(0x1) << EIC_LEVEL_INT2_Pos)
#define EIC_LEVEL_INT3_Pos          3            /**< \brief (EIC_LEVEL) External Interrupt 3 */
#define EIC_LEVEL_INT3              (_U(0x1) << EIC_LEVEL_INT3_Pos)
#define EIC_LEVEL_INT4_Pos          4            /**< \brief (EIC_LEVEL) External Interrupt 4 */
#define EIC_LEVEL_INT4              (_U(0x1) << EIC_LEVEL_INT4_Pos)
#define EIC_LEVEL_INT5_Pos          5            /**< \brief (EIC_LEVEL) External Interrupt 5 */
#define EIC_LEVEL_INT5              (_U(0x1) << EIC_LEVEL_INT5_Pos)
#define EIC_LEVEL_INT6_Pos          6            /**< \brief (EIC_LEVEL) External Interrupt 6 */
#define EIC_LEVEL_INT6              (_U(0x1) << EIC_LEVEL_INT6_Pos)
#define EIC_LEVEL_INT7_Pos          7            /**< \brief (EIC_LEVEL) External Interrupt 7 */
#define EIC_LEVEL_INT7              (_U(0x1) << EIC_LEVEL_INT7_Pos)
#define EIC_LEVEL_INT8_Pos          8            /**< \brief (EIC_LEVEL) External Interrupt 8 */
#define EIC_LEVEL_INT8              (_U(0x1) << EIC_LEVEL_INT8_Pos)
#define EIC_LEVEL_INT9_Pos          9            /**< \brief (EIC_LEVEL) External Interrupt 9 */
#define EIC_LEVEL_INT9              (_U(0x1) << EIC_LEVEL_INT9_Pos)
#define EIC_LEVEL_INT10_Pos         10           /**< \brief (EIC_LEVEL) External Interrupt 10 */
#define EIC_LEVEL_INT10             (_U(0x1) << EIC_LEVEL_INT10_Pos)
#define EIC_LEVEL_INT11_Pos         11           /**< \brief (EIC_LEVEL) External Interrupt 11 */
#define EIC_LEVEL_INT11             (_U(0x1) << EIC_LEVEL_INT11_Pos)
#define EIC_LEVEL_INT12_Pos         12           /**< \brief (EIC_LEVEL) External Interrupt 12 */
#define EIC_LEVEL_INT12             (_U(0x1) << EIC_LEVEL_INT12_Pos)
#define EIC_LEVEL_INT13_Pos         13           /**< \brief (EIC_LEVEL) External Interrupt 13 */
#define EIC_LEVEL_INT13             (_U(0x1) << EIC_LEVEL_INT13_Pos)
#define EIC_LEVEL_INT14_Pos         14           /**< \brief (EIC_LEVEL) External Interrupt 14 */
#define EIC_LEVEL_INT14             (_U(0x1) << EIC_LEVEL_INT14_Pos)
#define EIC_LEVEL_INT15_Pos         15           /**< \brief (EIC_LEVEL) External Interrupt 15 */
#define EIC_LEVEL_INT15             (_U(0x1) << EIC_LEVEL_INT15_Pos)
#define EIC_LEVEL_MASK              _U(0x0000FFFF) /**< \brief (EIC_LEVEL) MASK Register */

/* -------- EIC_FILTER : (EIC Offset: 0x020) (R/W 32) Filter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_FILTER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_FILTER_OFFSET           0x020        /**< \brief (EIC_FILTER offset) Filter Register */
#define EIC_FILTER_RESETVALUE       _U(0x00000000); /**< \brief (EIC_FILTER reset_value) Filter Register */

#define EIC_FILTER_NMI_Pos          0            /**< \brief (EIC_FILTER) External Non Maskable CPU interrupt */
#define EIC_FILTER_NMI              (_U(0x1) << EIC_FILTER_NMI_Pos)
#define EIC_FILTER_INT1_Pos         1            /**< \brief (EIC_FILTER) External Interrupt 1 */
#define EIC_FILTER_INT1             (_U(0x1) << EIC_FILTER_INT1_Pos)
#define EIC_FILTER_INT2_Pos         2            /**< \brief (EIC_FILTER) External Interrupt 2 */
#define EIC_FILTER_INT2             (_U(0x1) << EIC_FILTER_INT2_Pos)
#define EIC_FILTER_INT3_Pos         3            /**< \brief (EIC_FILTER) External Interrupt 3 */
#define EIC_FILTER_INT3             (_U(0x1) << EIC_FILTER_INT3_Pos)
#define EIC_FILTER_INT4_Pos         4            /**< \brief (EIC_FILTER) External Interrupt 4 */
#define EIC_FILTER_INT4             (_U(0x1) << EIC_FILTER_INT4_Pos)
#define EIC_FILTER_INT5_Pos         5            /**< \brief (EIC_FILTER) External Interrupt 5 */
#define EIC_FILTER_INT5             (_U(0x1) << EIC_FILTER_INT5_Pos)
#define EIC_FILTER_INT6_Pos         6            /**< \brief (EIC_FILTER) External Interrupt 6 */
#define EIC_FILTER_INT6             (_U(0x1) << EIC_FILTER_INT6_Pos)
#define EIC_FILTER_INT7_Pos         7            /**< \brief (EIC_FILTER) External Interrupt 7 */
#define EIC_FILTER_INT7             (_U(0x1) << EIC_FILTER_INT7_Pos)
#define EIC_FILTER_INT8_Pos         8            /**< \brief (EIC_FILTER) External Interrupt 8 */
#define EIC_FILTER_INT8             (_U(0x1) << EIC_FILTER_INT8_Pos)
#define EIC_FILTER_INT9_Pos         9            /**< \brief (EIC_FILTER) External Interrupt 9 */
#define EIC_FILTER_INT9             (_U(0x1) << EIC_FILTER_INT9_Pos)
#define EIC_FILTER_INT10_Pos        10           /**< \brief (EIC_FILTER) External Interrupt 10 */
#define EIC_FILTER_INT10            (_U(0x1) << EIC_FILTER_INT10_Pos)
#define EIC_FILTER_INT11_Pos        11           /**< \brief (EIC_FILTER) External Interrupt 11 */
#define EIC_FILTER_INT11            (_U(0x1) << EIC_FILTER_INT11_Pos)
#define EIC_FILTER_INT12_Pos        12           /**< \brief (EIC_FILTER) External Interrupt 12 */
#define EIC_FILTER_INT12            (_U(0x1) << EIC_FILTER_INT12_Pos)
#define EIC_FILTER_INT13_Pos        13           /**< \brief (EIC_FILTER) External Interrupt 13 */
#define EIC_FILTER_INT13            (_U(0x1) << EIC_FILTER_INT13_Pos)
#define EIC_FILTER_INT14_Pos        14           /**< \brief (EIC_FILTER) External Interrupt 14 */
#define EIC_FILTER_INT14            (_U(0x1) << EIC_FILTER_INT14_Pos)
#define EIC_FILTER_INT15_Pos        15           /**< \brief (EIC_FILTER) External Interrupt 15 */
#define EIC_FILTER_INT15            (_U(0x1) << EIC_FILTER_INT15_Pos)
#define EIC_FILTER_MASK             _U(0x0000FFFF) /**< \brief (EIC_FILTER) MASK Register */

/* -------- EIC_ASYNC : (EIC Offset: 0x028) (R/W 32) Asynchronous Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_ASYNC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_ASYNC_OFFSET            0x028        /**< \brief (EIC_ASYNC offset) Asynchronous Register */
#define EIC_ASYNC_RESETVALUE        _U(0x00000000); /**< \brief (EIC_ASYNC reset_value) Asynchronous Register */

#define EIC_ASYNC_NMI_Pos           0            /**< \brief (EIC_ASYNC) External Non Maskable CPU interrupt */
#define EIC_ASYNC_NMI               (_U(0x1) << EIC_ASYNC_NMI_Pos)
#define EIC_ASYNC_INT1_Pos          1            /**< \brief (EIC_ASYNC) External Interrupt 1 */
#define EIC_ASYNC_INT1              (_U(0x1) << EIC_ASYNC_INT1_Pos)
#define EIC_ASYNC_INT2_Pos          2            /**< \brief (EIC_ASYNC) External Interrupt 2 */
#define EIC_ASYNC_INT2              (_U(0x1) << EIC_ASYNC_INT2_Pos)
#define EIC_ASYNC_INT3_Pos          3            /**< \brief (EIC_ASYNC) External Interrupt 3 */
#define EIC_ASYNC_INT3              (_U(0x1) << EIC_ASYNC_INT3_Pos)
#define EIC_ASYNC_INT4_Pos          4            /**< \brief (EIC_ASYNC) External Interrupt 4 */
#define EIC_ASYNC_INT4              (_U(0x1) << EIC_ASYNC_INT4_Pos)
#define EIC_ASYNC_INT5_Pos          5            /**< \brief (EIC_ASYNC) External Interrupt 5 */
#define EIC_ASYNC_INT5              (_U(0x1) << EIC_ASYNC_INT5_Pos)
#define EIC_ASYNC_INT6_Pos          6            /**< \brief (EIC_ASYNC) External Interrupt 6 */
#define EIC_ASYNC_INT6              (_U(0x1) << EIC_ASYNC_INT6_Pos)
#define EIC_ASYNC_INT7_Pos          7            /**< \brief (EIC_ASYNC) External Interrupt 7 */
#define EIC_ASYNC_INT7              (_U(0x1) << EIC_ASYNC_INT7_Pos)
#define EIC_ASYNC_INT8_Pos          8            /**< \brief (EIC_ASYNC) External Interrupt 8 */
#define EIC_ASYNC_INT8              (_U(0x1) << EIC_ASYNC_INT8_Pos)
#define EIC_ASYNC_INT9_Pos          9            /**< \brief (EIC_ASYNC) External Interrupt 9 */
#define EIC_ASYNC_INT9              (_U(0x1) << EIC_ASYNC_INT9_Pos)
#define EIC_ASYNC_INT10_Pos         10           /**< \brief (EIC_ASYNC) External Interrupt 10 */
#define EIC_ASYNC_INT10             (_U(0x1) << EIC_ASYNC_INT10_Pos)
#define EIC_ASYNC_INT11_Pos         11           /**< \brief (EIC_ASYNC) External Interrupt 11 */
#define EIC_ASYNC_INT11             (_U(0x1) << EIC_ASYNC_INT11_Pos)
#define EIC_ASYNC_INT12_Pos         12           /**< \brief (EIC_ASYNC) External Interrupt 12 */
#define EIC_ASYNC_INT12             (_U(0x1) << EIC_ASYNC_INT12_Pos)
#define EIC_ASYNC_INT13_Pos         13           /**< \brief (EIC_ASYNC) External Interrupt 13 */
#define EIC_ASYNC_INT13             (_U(0x1) << EIC_ASYNC_INT13_Pos)
#define EIC_ASYNC_INT14_Pos         14           /**< \brief (EIC_ASYNC) External Interrupt 14 */
#define EIC_ASYNC_INT14             (_U(0x1) << EIC_ASYNC_INT14_Pos)
#define EIC_ASYNC_INT15_Pos         15           /**< \brief (EIC_ASYNC) External Interrupt 15 */
#define EIC_ASYNC_INT15             (_U(0x1) << EIC_ASYNC_INT15_Pos)
#define EIC_ASYNC_MASK              _U(0x0000FFFF) /**< \brief (EIC_ASYNC) MASK Register */

/* -------- EIC_EN : (EIC Offset: 0x030) ( /W 32) Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_EN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_EN_OFFSET               0x030        /**< \brief (EIC_EN offset) Enable Register */
#define EIC_EN_RESETVALUE           _U(0x00000000); /**< \brief (EIC_EN reset_value) Enable Register */

#define EIC_EN_NMI_Pos              0            /**< \brief (EIC_EN) External Non Maskable CPU interrupt */
#define EIC_EN_NMI                  (_U(0x1) << EIC_EN_NMI_Pos)
#define EIC_EN_INT1_Pos             1            /**< \brief (EIC_EN) External Interrupt 1 */
#define EIC_EN_INT1                 (_U(0x1) << EIC_EN_INT1_Pos)
#define EIC_EN_INT2_Pos             2            /**< \brief (EIC_EN) External Interrupt 2 */
#define EIC_EN_INT2                 (_U(0x1) << EIC_EN_INT2_Pos)
#define EIC_EN_INT3_Pos             3            /**< \brief (EIC_EN) External Interrupt 3 */
#define EIC_EN_INT3                 (_U(0x1) << EIC_EN_INT3_Pos)
#define EIC_EN_INT4_Pos             4            /**< \brief (EIC_EN) External Interrupt 4 */
#define EIC_EN_INT4                 (_U(0x1) << EIC_EN_INT4_Pos)
#define EIC_EN_INT5_Pos             5            /**< \brief (EIC_EN) External Interrupt 5 */
#define EIC_EN_INT5                 (_U(0x1) << EIC_EN_INT5_Pos)
#define EIC_EN_INT6_Pos             6            /**< \brief (EIC_EN) External Interrupt 6 */
#define EIC_EN_INT6                 (_U(0x1) << EIC_EN_INT6_Pos)
#define EIC_EN_INT7_Pos             7            /**< \brief (EIC_EN) External Interrupt 7 */
#define EIC_EN_INT7                 (_U(0x1) << EIC_EN_INT7_Pos)
#define EIC_EN_INT8_Pos             8            /**< \brief (EIC_EN) External Interrupt 8 */
#define EIC_EN_INT8                 (_U(0x1) << EIC_EN_INT8_Pos)
#define EIC_EN_INT9_Pos             9            /**< \brief (EIC_EN) External Interrupt 9 */
#define EIC_EN_INT9                 (_U(0x1) << EIC_EN_INT9_Pos)
#define EIC_EN_INT10_Pos            10           /**< \brief (EIC_EN) External Interrupt 10 */
#define EIC_EN_INT10                (_U(0x1) << EIC_EN_INT10_Pos)
#define EIC_EN_INT11_Pos            11           /**< \brief (EIC_EN) External Interrupt 11 */
#define EIC_EN_INT11                (_U(0x1) << EIC_EN_INT11_Pos)
#define EIC_EN_INT12_Pos            12           /**< \brief (EIC_EN) External Interrupt 12 */
#define EIC_EN_INT12                (_U(0x1) << EIC_EN_INT12_Pos)
#define EIC_EN_INT13_Pos            13           /**< \brief (EIC_EN) External Interrupt 13 */
#define EIC_EN_INT13                (_U(0x1) << EIC_EN_INT13_Pos)
#define EIC_EN_INT14_Pos            14           /**< \brief (EIC_EN) External Interrupt 14 */
#define EIC_EN_INT14                (_U(0x1) << EIC_EN_INT14_Pos)
#define EIC_EN_INT15_Pos            15           /**< \brief (EIC_EN) External Interrupt 15 */
#define EIC_EN_INT15                (_U(0x1) << EIC_EN_INT15_Pos)
#define EIC_EN_MASK                 _U(0x0000FFFF) /**< \brief (EIC_EN) MASK Register */

/* -------- EIC_DIS : (EIC Offset: 0x034) ( /W 32) Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NMI:1;            /*!< bit:      0  External Non Maskable CPU interrupt */
    uint32_t INT1:1;           /*!< bit:      1  External Interrupt 1               */
    uint32_t INT2:1;           /*!< bit:      2  External Interrupt 2               */
    uint32_t INT3:1;           /*!< bit:      3  External Interrupt 3               */
    uint32_t INT4:1;           /*!< bit:      4  External Interrupt 4               */
    uint32_t INT5:1;           /*!< bit:      5  External Interrupt 5               */
    uint32_t INT6:1;           /*!< bit:      6  External Interrupt 6               */
    uint32_t INT7:1;           /*!< bit:      7  External Interrupt 7               */
    uint32_t INT8:1;           /*!< bit:      8  External Interrupt 8               */
    uint32_t INT9:1;           /*!< bit:      9  External Interrupt 9               */
    uint32_t INT10:1;          /*!< bit:     10  External Interrupt 10              */
    uint32_t INT11:1;          /*!< bit:     11  External Interrupt 11              */
    uint32_t INT12:1;          /*!< bit:     12  External Interrupt 12              */
    uint32_t INT13:1;          /*!< bit:     13  External Interrupt 13              */
    uint32_t INT14:1;          /*!< bit:     14  External Interrupt 14              */
    uint32_t INT15:1;          /*!< bit:     15  External Interrupt 15              */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} EIC_DIS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

